{
  "portfolioItems": [
    {
      "title": "PCH Quizzes",
      "description":
        "Users answer questions on a wide variety of topics to earn tokens that can be exchanged for prizes and sweepstakes entries.  Integrated existing quizzes codebase from acquisition into PCH codebase while adding incentives for users to continuing playing with bonus entries and promotional messaging",
      "logo": "quizzes.jpg",
      "platforms": "Desktop, Mobile",
      "technology":
        "Vue, Javascript, Webpack,  ESLint, Prettier, PHP (Laravel), SEO",
      "url": "http://quizzes.pch.com"
    },
    
    {
      "title": "PCH Keno",
      "description":
        "Users pick numbers from 5 game cards with live drawings every 20 minutes where users match numbers for cash prizes.  Users also unlock various instant win scratch cards for playing cards and watching video ads.  For this project, we used a custom MVC js framework that handled gameplay, live drawings, and the overall user flow while making API calls to the backend to handle sending and receiving gameplay data.  Implemented many shared and 3rd party systems responsible for user registration, messaging, tracking, and retention  ",
      "logo": "keno.jpg",
      "platforms": "Desktop, Mobile",
      "technology":
        "Javascript, MVC, Webpack, Gulp, Git, ESLint, Prettier, HTML5/CSS3, PHP (Laravel), SEO",
      "url": "http://keno.pch.com",
      "git": "https://github.com/cbutera484/pchkeno"
    },
    {
      "title": "PCH Lotto",
      "description":
        "Users play lotto cards for a daily drawing to win cash prizes and unlock instant win scratch cards.  Built templates to streamline building of multiple lotto cards with complex animations on a monthly basis.  Implemented many shared and 3rd party systems responsible for user registration, messaging, tracking, and retention     ",
      "logo": "lotto.jpg",
      "platforms": "Desktop, Mobile",
      "technology":
        "Javascript, MVC, Webpack, Gulp, Git, ESLint, Prettier, HTML5/CSS3, PHP (Laravel), SEO",
      "url": "http://lotto.pch.com"
    },
    {
      "title": "PCH.com",
      "description":
        "Sweepstakes game portal where users are directed to a variety of games and contests to win cash and prizes.  Built a custom MVC js framework that handled gameplay, live drawings, and the overall user flow while making API calls to the backend to handle sending and receiving gameplay data.  Implemented many shared and 3rd party systems responsible for user registration, messaging, tracking, and retention",
      "logo": "pchcom.jpg",
      "platforms": "Desktop, Mobile",
      "technology":
        "Vue, Javascript, Webpack,  ESLint, Prettier, PHP (Laravel), SEO",
      "url": "http://www.pch.com"
    },
    {
      "title": "PCH Weekly Grand Prize",
      "description":
        "Landing page for a weekly promotional prize designed to bring in new traffic and users while directing users to download the PCH+ app",
      "logo": "weekly-grand-prize.jpg",
      "platforms": "Desktop, Mobile",
      "technology":
        "Vue, Javascript, Webpack,  ESLint, Prettier, PHP (Laravel), SEO",
      "url": "https://rewards.pch.com/weekly-grand-prize"
    },
    {
      "title": "McCormick 2011 Annual Report",
      "description":
        "Interactive annual report built under a very tight deadline.  ",
      "logo": "mccormick.jpg",
      "platforms": "Desktop",
      "technology": "Javascript, jQuery, html/css",
      "url":
        "http://media.corporate-ir.net/media_files/irol/65/65454/reports/MKC_IAR11/export8/index.html"
    }
  ]
}
